![title](img/cover4.png)

<center><em>Copyright! This material is protected, please do not copy or distribute.    by:Taher Assaf</em></center>

***
<h1 align="center">Udemy course : Python Bootcamp for Data Science 2021 Numpy Pandas & Seaborn</h1> 

***

## 12.1 Reshaping by Stacking and Unstacking

First we import pandas library:

In [1]:
import pandas as pd

No we will read a dataframe from a csv file using the function **pd.read_csv()**:

In [2]:
data = pd.read_csv('data/ex6.csv', index_col = 'branch number')
data

               sale1  sale2  sale3
branch number
branch1          200    258    592
branch2          328    664    606
branch3          870    249    918
branch4          209    971    629

We can reshape this dataframe where the columns will be the rows using the function **stack()**:

In [3]:
data2 = data.stack()
data2

branch number
branch1        sale1    200
               sale2    258
               sale3    592
branch2        sale1    328
               sale2    664
               sale3    606
branch3        sale1    870
               sale2    249
               sale3    918
branch4        sale1    209
               sale2    971
               sale3    629
dtype: int64

The **unstack()** function does the opposite: remove the innermost row index to be the columns:

In [4]:
data2.unstack()

               sale1  sale2  sale3
branch number
branch1          200    258    592
branch2          328    664    606
branch3          870    249    918
branch4          209    971    629

We can choose which index level to be moved by specifying the level number ( 0 for outer index and 1 for inner index)

In [5]:
data2.unstack(0)

branch number  branch1  branch2  branch3  branch4
sale1              200      328      870      209
sale2              258      664      249      971
sale3              592      606      918      629

We can also specify the index level by its **name**, here instead of **(0)**, we can use **'branch number'**:

In [6]:
data2.unstack('branch number')

branch number  branch1  branch2  branch3  branch4
sale1              200      328      870      209
sale2              258      664      249      971
sale3              592      606      918      629

For dataframes, lets first read this dataframe and set its index to multiple columns, in this example: 'year' and 'quarters':

In [7]:
frame1 = pd.read_csv('data/ex5.csv', index_col = ['year', 'quarters'])
frame1

               sale1  sale2  sale3
year quarters
2010 A           200    258    592
     B           328    664    606
     C           870    249    918
     D           209    971    629
2011 A           348    863    929
     B           475    999    610
     C           944    356    540
     D           190     12    673
2012 A           129    936     14
     B            31    877    181
     C           646    768    862
     D           284    792    688

To move the innermost row index('quaretrs') to the columns, we use the function **unstack()**:

In [8]:
frame1.unstack()

         sale1                sale2                sale3
quarters     A    B    C    D     A    B    C    D     A    B    C    D
year
2010       200  328  870  209   258  664  249  971   592  606  918  629
2011       348  475  944  190   863  999  356   12   929  610  540  673
2012       129   31  646  284   936  877  768  792    14  181  862  688

We can also move the outer row index ('year') from rows to the columns:

In [9]:
frame2 = frame1.unstack('year')
frame2

         sale1           sale2           sale3
year      2010 2011 2012  2010 2011 2012  2010 2011 2012
quarters
A          200  348  129   258  863  936   592  929   14
B          328  475   31   664  999  877   606  610  181
C          870  944  646   249  356  768   918  540  862
D          209  190  284   971   12  792   629  673  688

To do the oppsite: to move columns to the row index, we use the function **stack()**:

In [10]:
frame2.stack()

               sale1  sale2  sale3
quarters year
A        2010    200    258    592
         2011    348    863    929
         2012    129    936     14
B        2010    328    664    606
         2011    475    999    610
         2012     31    877    181
C        2010    870    249    918
         2011    944    356    540
         2012    646    768    862
D        2010    209    971    629
         2011    190     12    673
         2012    284    792    688

***

<h1 align="center">Thank You</h1> 

***